Project By : mariam asal , fares ashraf , ahmed ekramy

#### Car Sales Analysis

The dataset is a detailed record of car sales transactions, encompassing 23,906 entries with various attributes related to the sales process. It includes information on the cars sold, such as the model, company, engine type, transmission, and color, as well as details about the customers, including their names, genders, annual incomes, and regions. Additionally, the dataset records the specifics of each sale, including the price, date of sale, and dealership details. This data serves as a comprehensive source for analyzing car sales trends, customer demographics, and dealership performance, making it valuable for conducting in-depth analysis, data cleaning, and aggregation to derive meaningful insights.

### Import Library

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv(r"E:\NTI\Python\project\Car Sales.xlsx - car_data.csv")

In [46]:
data

,Date,Customer Name,Gender,Annual Income,Company,Model,Transmission,Color,Price ($),Dealer_No,Body Style,Dealer_Region
0,2022-01-02,Geraldine,Male,13500,Ford,Expedition,Auto,Black,26000,06457-3834,SUV,Middletown
1,2022-01-02,Gia,Male,1480000,Dodge,Durango,Auto,Black,19000,60504-7114,SUV,Aurora
2,2022-01-02,Gianna,Male,1035000,Cadillac,Eldorado,Manual,Red,31500,38701-8047,Passenger,Greenville
3,2022-01-02,Giselle,Male,13500,Toyota,Celica,Manual,Pale White,14000,99301-3882,SUV,Pasco
4,2022-01-02,Grace,Male,1465000,Acura,TL,Auto,Red,24500,53546-9427,Hatchback,Janesville
...,...,...,...,...,...,...,...,...,...,...,...,...
23901,2023-12-31,Martin,Male,13500,Plymouth,Voyager,Manual,Red,12000,60504-7114,Passenger,Pasco
23902,2023-12-31,Jimmy,Female,900000,Chevrolet,Prizm,Auto,Black,16000,06457-3834,Hardtop,Middletown
23903,2023-12-31,Emma,Male,705000,BMW,328i,Manual,Red,21000,99301-3882,Sedan,Scottsdale
23904,2023-12-31,Victoire,Male,13500,Chevrolet,Metro,Auto,Black,31000,53546-9427,Passenger,Austin
23905,2023-12-31,Donovan,Male,1225000,Lexus,ES300,Auto,Pale White,27500,38701-8047,Hardtop,Middletown

### Data Explore

In [47]:
#Explore Data
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 23905 entries, 0 to 23905
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           23905 non-null  datetime64[ns]
 1   Customer Name  23905 non-null  object
 2   Gender         23905 non-null  object
 3   Annual Income  23905 non-null  int64
 4   Company        23905 non-null  object
 5   Model          23905 non-null  object
 6   Transmission   23905 non-null  object
 7   Color          23905 non-null  object
 8   Price ($)      23905 non-null  int64
 9   Dealer_No      23905 non-null  object
 10  Body Style     23905 non-null  object
 11  Dealer_Region  23905 non-null  object
dtypes: datetime64[ns](1), int64(2), object(9)
memory usage: 2.4+ MB

In [48]:
# Number of  rows and columns
data.shape

(23905, 12)

### Data Cleaning & Exploration

In [49]:
# Droping columns
data = data.drop(['Dealer_Name'] , axis =1)
data = data.drop(['Engine'] , axis =1)
data = data.drop(['Dealer_No'] , axis =1)

In [33]:
data

,Date,Customer Name,Gender,Annual Income,Company,Model,Transmission,Color,Price ($),Dealer_No,Body Style,Dealer_Region
0,1/2/2022,Geraldine,Male,13500,Ford,Expedition,Auto,Black,26000,06457-3834,SUV,Middletown
1,1/2/2022,Gia,Male,1480000,Dodge,Durango,Auto,Black,19000,60504-7114,SUV,Aurora
2,1/2/2022,Gianna,Male,1035000,Cadillac,Eldorado,Manual,Red,31500,38701-8047,Passenger,Greenville
3,1/2/2022,Giselle,Male,13500,Toyota,Celica,Manual,Pale White,14000,99301-3882,SUV,Pasco
4,1/2/2022,Grace,Male,1465000,Acura,TL,Auto,Red,24500,53546-9427,Hatchback,Janesville
...,...,...,...,...,...,...,...,...,...,...,...,...
23901,12/31/2023,Martin,Male,13500,Plymouth,Voyager,Manual,Red,12000,60504-7114,Passenger,Pasco
23902,12/31/2023,Jimmy,Female,900000,Chevrolet,Prizm,Auto,Black,16000,06457-3834,Hardtop,Middletown
23903,12/31/2023,Emma,Male,705000,BMW,328i,Manual,Red,21000,99301-3882,Sedan,Scottsdale
23904,12/31/2023,Victoire,Male,13500,Chevrolet,Metro,Auto,Black,31000,53546-9427,Passenger,Austin
23905,12/31/2023,Donovan,Male,1225000,Lexus,ES300,Auto,Pale White,27500,38701-8047,Hardtop,Middletown

In [ ]:
#create column year
data['Year'] = pd.DatetimeIndex(data['Date']).year

In [26]:
# Check for null values
data.isnull().sum()

Date             0
Customer Name    1
Gender           0
Annual Income    0
Company          0
Model            0
Transmission     0
Color            0
Price ($)        0
Dealer_No        0
Body Style       0
Dealer_Region    0
dtype: int64

In [27]:
#Drop rows with null values
data.dropna(inplace=True)

In [28]:
data.isnull().sum()

Date             0
Customer Name    0
Gender           0
Annual Income    0
Company          0
Model            0
Transmission     0
Color            0
Price ($)        0
Dealer_No        0
Body Style       0
Dealer_Region    0
dtype: int64

In [29]:
#check for duplicates
data.duplicated().sum()

np.int64(0)

In [37]:
#convert data to datetime
data['Date'] = pd.to_datetime(data['Date'])

In [39]:
data.columns

Index(['Date', 'Customer Name', 'Gender', 'Annual Income', 'Company', 'Model',
       'Transmission', 'Color', 'Price ($)', 'Dealer_No ', 'Body Style',
       'Dealer_Region'],
      dtype='object')

In [43]:
#count value for each column
data['Company'].value_counts()

Company
Chevrolet     1819
Dodge         1670
Ford          1614
Volkswagen    1333
Mercedes-B    1285
Mitsubishi    1277
Chrysler      1120
Oldsmobile    1111
Toyota        1110
Nissan         886
Mercury        874
Lexus          802
Pontiac        796
BMW            790
Volvo          789
Honda          708
Acura          689
Cadillac       652
Plymouth       617
Saturn         586
Lincoln        492
Audi           468
Buick          439
Subaru         405
Jeep           363
Porsche        361
Hyundai        264
Saab           210
Infiniti       195
Jaguar         180
Name: count, dtype: int64

In [45]:
data['Model'].value_counts()

Model
Diamante         418
Prizm            411
Silhouette       411
Passat           391
Ram Pickup       382
                ...
Mirage            19
Alero             18
RX300             15
Avalon            15
Sebring Conv.     10
Name: count, Length: 154, dtype: int64

In [50]:
#show unique values
data['Company'].unique()

array(['Ford', 'Dodge', 'Cadillac', 'Toyota', 'Acura', 'Mitsubishi',
       'Chevrolet', 'Nissan', 'Mercury', 'BMW', 'Chrysler', 'Subaru',
       'Hyundai', 'Honda', 'Infiniti', 'Audi', 'Porsche', 'Volkswagen',
       'Buick', 'Saturn', 'Mercedes-B', 'Jaguar', 'Volvo', 'Pontiac',
       'Lincoln', 'Oldsmobile', 'Lexus', 'Plymouth', 'Saab', 'Jeep'],
      dtype=object)

In [51]:
data['Model'].unique()

array(['Expedition', 'Durango', 'Eldorado', 'Celica', 'TL', 'Diamante',
       'Corolla', 'Galant', 'Malibu', 'Escort', 'RL', 'Pathfinder',
       'Grand Marquis', '323i', 'Sebring Coupe', 'Forester', 'Accent',
       'Land Cruiser', 'Accord', '4Runner', 'I30', 'A4', 'Carrera Cabrio',
       'Jetta', 'Viper', 'Regal', 'LHS', 'LW', '3000GT', 'SLK230',
       'Civic', 'S-Type', 'S40', 'Mountaineer', 'Park Avenue',
       'Montero Sport', 'Sentra', 'S80', 'Lumina', 'Bonneville',
       'C-Class', 'Altima', 'DeVille', 'Stratus', 'Cougar', 'SW', 'C70',
       'SLK', 'Tacoma', 'M-Class', 'A6', 'Intrepid', 'Sienna', 'Eclipse',
       'Contour', 'Town car', 'Focus', 'Mustang', 'Cutlass', 'Corvette',
       'Impala', 'Cabrio', 'Dakota', '300M', '328i', 'Bravada', 'Maxima',
       'Ram Pickup', 'Concorde', 'V70', 'Quest', 'ES300', 'SL-Class',
       'Explorer', 'Prizm', 'Camaro', 'Outback', 'Taurus', 'Cavalier',
       'GS400', 'Monte Carlo', 'Sonata', 'Sable', 'Metro', 'Voyager',
       'Cirrus', 'Avenger', 'Odyssey', 'Intrigue', 'Silhouette', '5-Sep',
       '528i', 'LS400', 'Aurora', 'Breeze', 'Beetle', 'Elantra',
       'Continental', 'RAV4', 'Villager', 'S70', 'LS', 'Ram Van',
       'S-Class', 'E-Class', 'Grand Am', 'SC', 'Passat', 'Xterra',
       'Frontier', 'Crown Victoria', 'Camry', 'Navigator', 'CL500',
       'Escalade', 'Golf', 'Ranger', 'Prowler', 'Windstar', 'GTI',
       'Passport', 'Boxter', 'LX470', 'CR-V', 'Sunfire', 'Caravan',
       'Ram Wagon', 'Neon', 'Wrangler', 'Integra', 'Grand Prix',
       'Grand Cherokee', 'F-Series', 'A8', 'Mystique', '3-Sep',
       'Cherokee', 'Carrera Coupe', 'Catera', 'Seville', 'CLK Coupe',
       'LeSabre', 'Sebring Conv.', 'GS300', 'Firebird', 'V40', 'Montero',
       'Town & Country', 'SL', 'Alero', 'Mirage', 'Century', 'RX300',
       'Avalon'], dtype=object)

#### Data Aggregation

In [58]:
# Groubing by company and model

data.groupby('Company')['Model'].unique()

Company
Acura                                         [TL, RL, Integra]
Audi                                               [A4, A6, A8]
BMW                                          [323i, 328i, 528i]
Buick                    [Regal, Park Avenue, LeSabre, Century]
Cadillac         [Eldorado, DeVille, Escalade, Catera, Seville]
Chevrolet     [Malibu, Lumina, Corvette, Impala, Prizm, Cama...
Chrysler      [Sebring Coupe, LHS, 300M, Concorde, Cirrus, S...
Dodge         [Durango, Viper, Stratus, Intrepid, Dakota, Ra...
Ford          [Expedition, Escort, Contour, Focus, Mustang, ...
Honda                  [Accord, Civic, Odyssey, Passport, CR-V]
Hyundai                               [Accent, Sonata, Elantra]
Infiniti                                                  [I30]
Jaguar                                                 [S-Type]
Jeep                       [Wrangler, Grand Cherokee, Cherokee]
Lexus                [ES300, GS400, LS400, LX470, GS300, RX300]
Lincoln                      [Town car, Continental, Navigator]
Mercedes-B    [SLK230, C-Class, SLK, M-Class, SL-Class, S-Cl...
Mercury       [Grand Marquis, Mountaineer, Cougar, Sable, Vi...
Mitsubishi    [Diamante, Galant, 3000GT, Montero Sport, Ecli...
Nissan        [Pathfinder, Sentra, Altima, Maxima, Quest, Xt...
Oldsmobile    [Cutlass, Bravada, Intrigue, Silhouette, Auror...
Plymouth                       [Voyager, Breeze, Prowler, Neon]
Pontiac       [Bonneville, Grand Am, Sunfire, Grand Prix, Fi...
Porsche                 [Carrera Cabrio, Boxter, Carrera Coupe]
Saab                                             [5-Sep, 3-Sep]
Saturn                                     [LW, SW, LS, SC, SL]
Subaru                                      [Forester, Outback]
Toyota        [Celica, Corolla, Land Cruiser, 4Runner, Tacom...
Volkswagen           [Jetta, Cabrio, Beetle, Passat, Golf, GTI]
Volvo                            [S40, S80, C70, V70, S70, V40]
Name: Model, dtype: object

In [65]:
#data groub by transmission and Model
pd.set_option('display.max_rows',30)
data.groupby('Model')['Transmission'].unique().head(30)
#display max rows

Model
3-Sep                 [Auto]
3000GT        [Manual, Auto]
300M                  [Auto]
323i          [Auto, Manual]
328i          [Auto, Manual]
4Runner       [Manual, Auto]
5-Sep         [Manual, Auto]
528i          [Manual, Auto]
A4            [Manual, Auto]
A6            [Auto, Manual]
A8                  [Manual]
Accent              [Manual]
Accord        [Auto, Manual]
Alero               [Manual]
Altima                [Auto]
Aurora        [Manual, Auto]
Avalon                [Auto]
Avenger               [Auto]
Beetle        [Auto, Manual]
Bonneville    [Manual, Auto]
Boxter        [Manual, Auto]
Bravada       [Auto, Manual]
Breeze        [Manual, Auto]
C-Class       [Manual, Auto]
C70           [Manual, Auto]
CL500               [Manual]
CLK Coupe             [Auto]
CR-V                  [Auto]
Cabrio        [Manual, Auto]
Camaro                [Auto]
Name: Transmission, dtype: object

Statistical Operations

In [66]:
data.describe()

                                Date  Annual Income     Price ($)
count                          23905   2.390500e+04  23905.000000
mean   2023-03-01 14:35:12.261033216   8.308466e+05  28089.540473
min              2022-01-02 00:00:00   1.008000e+04   1200.000000
25%              2022-09-20 00:00:00   3.860000e+05  18001.000000
50%              2023-03-13 00:00:00   7.350000e+05  23000.000000
75%              2023-09-08 00:00:00   1.176000e+06  34000.000000
max              2023-12-31 00:00:00   1.120000e+07  85800.000000
std                              NaN   7.200208e+05  14788.592495

In [71]:
#statistical summary for objects
data.describe(include = 'object')

,Customer Name,Gender,Company,Model,Transmission,Color,Dealer_No,Body Style,Dealer_Region
count,23905,23905,23905,23905,23905,23905,23905,23905,23905
unique,3021,2,30,154,2,3,7,5,7
top,Thomas,Male,Chevrolet,Diamante,Auto,Pale White,85257-3102,SUV,Austin
freq,92,18797,1819,418,12570,11255,3814,6374,4135

###  Business Questions

In [74]:
#   Question 1- top 10 cusmomers by sales
data.groupby('Customer Name')['Price ($)'].sum().sort_values(ascending=False).head(10)

Customer Name
Emma      2796875
Lucas     2637188
Thomas    2547478
Alexis    2190772
Lea       2129534
Chloe     2028568
Nathan    2013534
Paul      1978928
Hugo      1929031
Louis     1834775
Name: Price ($), dtype: int64

In [75]:
#Question 2-  top 10 Modeles By Sales
data.groupby('Model')['Price ($)'].sum().sort_values(ascending=False).head(10)

Model
LS400            14263424
Jetta            12287736
Silhouette       12271849
Montero Sport    11472231
Ram Pickup       10610391
Eldorado          9725407
528i              9577927
Prizm             9386606
Diamante          9308151
LHS               9097717
Name: Price ($), dtype: int64

In [79]:
data['Body Style'].unique()

array(['SUV', 'Passenger', 'Hatchback', 'Hardtop', 'Sedan'], dtype=object)

In [87]:
#Question 3- Company by Body Style
data.groupby('Company')['Body Style'].unique()

Company
Acura                         [Hatchback, SUV, Passenger]
Audi                 [Hardtop, SUV, Passenger, Hatchback]
BMW                               [Hatchback, Sedan, SUV]
Buick         [Passenger, Hatchback, Sedan, Hardtop, SUV]
Cadillac      [Passenger, SUV, Sedan, Hatchback, Hardtop]
Chevrolet     [Hardtop, Passenger, SUV, Hatchback, Sedan]
Chrysler      [Sedan, Hatchback, SUV, Hardtop, Passenger]
Dodge         [SUV, Hatchback, Sedan, Hardtop, Passenger]
Ford          [SUV, Passenger, Sedan, Hardtop, Hatchback]
Honda         [Sedan, Hatchback, Passenger, Hardtop, SUV]
Hyundai                           [Hatchback, SUV, Sedan]
Infiniti                        [Hardtop, SUV, Hatchback]
Jaguar                                        [Passenger]
Jeep                              [Hatchback, SUV, Sedan]
Lexus         [SUV, Hatchback, Sedan, Passenger, Hardtop]
Lincoln                     [Hatchback, Passenger, Sedan]
Mercedes-B    [Hatchback, Passenger, Hardtop, SUV, Sedan]
Mercury       [SUV, Hatchback, Sedan, Passenger, Hardtop]
Mitsubishi    [Hatchback, Passenger, Sedan, SUV, Hardtop]
Nissan        [Hardtop, Passenger, Hatchback, Sedan, SUV]
Oldsmobile    [Sedan, Hatchback, SUV, Passenger, Hardtop]
Plymouth             [Passenger, SUV, Hatchback, Hardtop]
Pontiac       [Hatchback, SUV, Sedan, Passenger, Hardtop]
Porsche              [Passenger, SUV, Hatchback, Hardtop]
Saab                                   [Hatchback, Sedan]
Saturn        [Hatchback, Passenger, Sedan, Hardtop, SUV]
Subaru                          [Hatchback, SUV, Hardtop]
Toyota        [SUV, Passenger, Sedan, Hardtop, Hatchback]
Volkswagen    [Passenger, Sedan, SUV, Hatchback, Hardtop]
Volvo         [Sedan, Hatchback, Passenger, Hardtop, SUV]
Name: Body Style, dtype: object

In [93]:
    # Question 4- Total Sales By Year for each Company  
data.groupby(['Company' ,'Year'])['Price ($)'].sum()

Company     Year
Acura       2022     7712756
            2023     9345893
Audi        2022     4933136
            2023     5761502
BMW         2022     8393812
                      ...
Toyota      2023    17502675
Volkswagen  2022    15848524
            2023    18234357
Volvo       2022     9140961
            2023    12784239
Name: Price ($), Length: 60, dtype: int64

In [99]:
#Question 5 - Count total Genders for each Model
data.groupby(['Model','Gender'])['Gender'].count().sort_values(ascending=False)

Model       Gender
Silhouette  Male      341
Diamante    Male      335
Prizm       Male      313
Ram Pickup  Male      313
Passat      Male      312
                     ...
V40         Female      3
Mirage      Female      2
Avalon      Female      2
Alero       Female      2
RX300       Female      1
Name: Gender, Length: 308, dtype: int64

In [103]:
#Question 6 -Total Sales For each Gender 
data.groupby('Gender')['Price ($)'].sum()

Gender
Female    144440271
Male      527040194
Name: Price ($), dtype: int64

In [115]:
#Question 7- Top Annual Income for each Customers
data.groupby('Customer Name')['Annual Income'].max().sort_values(ascending=False).head(10)

Customer Name
Assia      11200000
Sofia       8000000
Makayla     7650000
Peyton      6800000
Josh        6600000
Eileen      6500000
Kayden      6460000
Avery       6400000
Clara       6400000
Yaakov      6240000
Name: Annual Income, dtype: int64

In [116]:
#Question 8- Sales For each Dealer_Region
data.groupby('Dealer_Region')['Price ($)'].sum()

Dealer_Region
Aurora         88642382
Austin        117192531
Greenville     88149602
Janesville    106351234
Middletown     87134628
Pasco          88040714
Scottsdale     95969374
Name: Price ($), dtype: int64

### Convert Data To Excel File

In [102]:
#export data 
data.to_excel(r'E:\newdata2.xlsx')